import { z } from "zod";

export const tagScheme = z.object({
  tag: z
    .string()
    .nonempty("태그를 입력하세요.")
    .max(12, "해시태그는 12자 이하여야 합니다.")
    .refine((val) => !/\s/.test(val), {
      message: "해시태그에는 띄어쓰기를 포함할 수 없습니다.",
    }),
});

export const boardWriteScheme = z.object({
  title: z.string().nonempty({ message: "제목을 입력하세요." }),
  content: z.preprocess((content) => {
    if (typeof content === "object" && content !== null) {
      return JSON.stringify(content);
    }

    return content;
  }, z.string().nonempty({ message: "내용을 입력하세요." })),
  tempCommunityId: z.number({
    required_error: "tempCommunityId는 필수 입력값입니다.",
    invalid_type_error: "tempCommunityId는 숫자여야 합니다.",
  }),
  hashtag: z
    .array(
      z
        .string()
        .max(12, { message: "해시태그는 12자 이하여야 합니다." })
        .refine((val) => !/\s/.test(val), {
          message: "해시태그에는 띄어쓰기를 포함할 수 없습니다.",
        })
    )
    .max(5, { message: "해시태그는 최대 5개까지만 등록할 수 있습니다." }),
});

export const searchBoardScheme = z.object({
  keyword: z
    .string()
    .min(2, { message: "검색어는 2글자 이상이어야 합니다." })
    .nonempty({ message: "검색어를 입력하세요." }),
});

export const tagDictionary = [
  "여행",
  "여행계획",
  "여행준비",
  "여행후기",
  "여행사진",
  "여행영상",
  "여행정보",
  "여행팁",
  "여행경비",
  "여행기록",
  "여행일기",
  "여행코스",
  "여행지",
  "여행지추천",
  "여행지리뷰",
  "여행지사진",
  "여행지영상",
  "동행",
  "동반자",
  "친구",
  "잡담",
  "정보공유",
  "가족여행",
  "혼자여행",
  "커플여행",
  "친구여행",
  "배낭여행",
  "패키지여행",
  "자유여행",
  "해외여행",
  "국내여행",
  "맛집탐방",
  "숙소추천",
  "액티비티",
  "관광명소",
  "힐링여행",
  "캠핑",
  "트레킹",
  "등산",
  "바다여행",
  "산책",
  "드라이브",
  "여행스타그램",
  "여행다이어리",
  "여행메이트",
  "여행가이드",
  "여행블로거",
  "여행유튜버",
  "여행인플루언서",
  "여행소품",
  "여행필수템",
  "여행패션",
  "여행화보",
  "여행감성",
  "여행에세이",
  "여행스토리",
  "여행추억",
  "여행기",
  "여행이야기",
  "여행일상",
  "여행추천지",
  "여행준비물",
  "여행코스추천",
  "인사",
  "항공권",
  "비행기팁",
  "렌트카",
  "공항팁",
  "기차여행",
  "버스여행",
  "당일치기",
  "장기여행",
  "워홀",
  "디지털노마드",
  "가성비여행",
  "럭셔리여행",
  "브이로그",
  "루트공유",
  "일정공유",
  "포토스팟",
  "도시여행",
  "자연여행",
  "유적지탐방",
  "테마파크",
  "여름여행",
  "겨울여행",
  "벚꽃여행",
  "단풍여행",
  "성수기여행",
  "비수기여행",
  "짐싸기",
  "환전팁",
  "유심추천",
  "로밍팁",
  "국내명소",
  "해외명소",
  "숨은명소",
  "로컬추천",
  "여행예산",
  "경비절약팁",
  "여행보험",
  "환율정보",
  "여행기념품",
  "현지쇼핑",
  "인생샷",
  "인스타감성",
  "틱톡여행",
  "첫여행",
  "혼행추천",
  "여행고수팁",
  "여행초보",
  "현지문화",
  "전통시장",
  "로컬음식",
  "여행사고",
  "분실물팁",
];
